cmsis-svd/cmsis-svd/data/Spansion/MB9BF61xT.svd
        <!-- REGISTER "UPCR5" -->
        <register>
          <name>UPCR5</name>
          <description>USB/Ethernet-PLL Control Register 5</description>
          <addressOffset>0x24</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x04</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPLLM" -->
            <field>
              <name>UPLLM</name>
              <description>Frequency division ratio (M) setting bit of the USB/Ethernet-PLL clock</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UPCR6" -->
        <register>
          <name>UPCR6</name>
          <description>USB/Ethernet-PLL Setting Register 6</description>
          <addressOffset>0x28</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x02</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UBSR" -->
            <field>
              <name>UBSR</name>
              <description>CLKPLL division ratio setting bit </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UPCR7" -->
        <register>
          <name>UPCR7</name>
          <description>USB/Ethernet-PLL Setting Register 7</description>
          <addressOffset>0x2C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EPLLEN" -->
            <field>
              <name>EPLLEN</name>
              <description>USB/Ethernet-PLL control bit in Timer mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UP_STR" -->
        <register>
          <name>UP_STR</name>
          <description>USB/Ethernet-PLL Status Register</description>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPRDY" -->
            <field>
              <name>UPRDY</name>
              <description>USB/Ethernet-PLL oscillation stabilization bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UPINT_ENR" -->
        <register>
          <name>UPINT_ENR</name>
          <description>USB/Ethernet-PLL Interrupt Source Enable Register</description>
          <addressOffset>0x18</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPCSE" -->
            <field>
              <name>UPCSE</name>
              <description>USB/Ethernet-PLL oscillation stabilization wait complete interrupt enable bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UPINT_STR" -->
        <register>
          <name>UPINT_STR</name>
          <description>USB/Ethernet-PLL Interrupt Source Status Register</description>
          <addressOffset>0x20</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPCSI" -->
            <field>
              <name>UPCSI</name>
              <description>USB/Ethernet-PLL interrupt source status bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UPINT_CLR" -->
        <register>
          <name>UPINT_CLR</name>
          <description>USB/Ethernet-PLL Interrupt Source Clear Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPCSC" -->
            <field>
              <name>UPCSC</name>
              <description>USB/Ethernet-PLL oscillation stabilization interrupt source clear bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "USBEN0" -->
        <register>
          <name>USBEN0</name>
          <description>USB0 Enable Register</description>
          <addressOffset>0x30</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "USBEN0" -->
            <field>
              <name>USBEN0</name>
              <description>USB0 enable bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
