cmsis-svd/cmsis-svd/data/Spansion/MB9BF61xT.svd
      </registers>
    </peripheral>
    <!-- PERIPHERAL "ETHERNET_MAC0" -->
    <peripheral>
      <name>ETHERNET_MAC0</name>
      <description>Ethernet-MAC 0</description>
      <groupName>ETHERNET_MAC0</groupName>
      <baseAddress>0x40064000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1058</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "ETHER_MAC0" -->
      <interrupt>
        <name>ETHER_MAC0</name>
        <value>32</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "MCR" -->
        <register>
          <name>MCR</name>
          <description>MAC Configuration Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x03FFFFFC</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CST" -->
            <field>
              <name>CST</name>
              <description>CRC stripping for Type frames</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TC" -->
            <field>
              <name>TC</name>
              <description>Transmit Configuration in RGMII</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WD" -->
            <field>
              <name>WD</name>
              <description>Watchdog Disable</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "JD" -->
            <field>
              <name>JD</name>
              <description>Jabber Disable</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BE" -->
            <field>
              <name>BE</name>
              <description>Frame Burst Enable</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "JE" -->
            <field>
              <name>JE</name>
              <description>Jumbo Frame Enable</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IFG" -->
            <field>
              <name>IFG</name>
              <description>Inter-Frame GAP</description>
              <lsb>17</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DCRS" -->
            <field>
              <name>DCRS</name>
              <description>Disable Carrier Sense During Transaction</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PS" -->
            <field>
              <name>PS</name>
              <description>Port Select</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FES" -->
            <field>
              <name>FES</name>
              <description>Speed</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DO" -->
            <field>
              <name>DO</name>
              <description>Disable Receive Own</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LM" -->
            <field>
              <name>LM</name>
              <description>Loop-back Mode</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DM" -->
            <field>
              <name>DM</name>
              <description>Duplex mode</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IPC" -->
            <field>
              <name>IPC</name>
              <description>Checksum Offload</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DR" -->
            <field>
              <name>DR</name>
              <description>Disable Retry</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LUD" -->
            <field>
              <name>LUD</name>
              <description>Link Up/Down in RGMII</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ACS" -->
            <field>
              <name>ACS</name>
              <description>Automatic Pad/CRC Stripping</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BL" -->
            <field>
              <name>BL</name>
              <description>Back-off Limit</description>
              <lsb>5</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DC" -->
            <field>
              <name>DC</name>
              <description>Deferral Check</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TE" -->
            <field>
              <name>TE</name>
              <description>Transmitter Enable</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RE" -->
            <field>
              <name>RE</name>
              <description>Receiver Enable</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MFFR" -->
        <register>
          <name>MFFR</name>
          <description>MAC Frame Filter Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x800007FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RA" -->
            <field>
              <name>RA</name>
              <description>Receive All</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HPF" -->
            <field>
              <name>HPF</name>
              <description>Hash or Perfect Filter</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SAF" -->
            <field>
              <name>SAF</name>
              <description>Source Address Filter</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SAIF" -->
            <field>
              <name>SAIF</name>
              <description>Source Address Inverse Filter</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PCF" -->
            <field>
              <name>PCF</name>
              <description>Pass Control Frames</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DB" -->
            <field>
              <name>DB</name>
              <description>Disable Broadcast Frames</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PM" -->
            <field>
              <name>PM</name>
              <description>Pass All Multicast</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DAIF" -->
            <field>
              <name>DAIF</name>
              <description>DA Inverse Filtering</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HMC" -->
            <field>
              <name>HMC</name>
              <description>Hash Multicast</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HUC" -->
            <field>
              <name>HUC</name>
              <description>Hash Unicast</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PR" -->
            <field>
              <name>PR</name>
              <description>Promiscuous Mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
